/*
Да се имплементира класа F1Race која ќе чита од влезен тек (стандарден влез, датотека, ...) податоци за времињата од последните 3 круга на неколку пилоти на Ф1 трка. Податоците се во следниот формат:

Driver_name lap1 lap2 lap3, притоа lap е во формат mm:ss:nnn каде mm се минути ss се секунди nnn се милисекунди (илјадити делови од секундата). Пример:

Vetel 1:55:523 1:54:987 1:56:134.

Ваша задача е да ги имплементирате методите:

F1Race() - default конструктор
void readResults(InputStream inputStream) - метод за читање на податоците
void printSorted(OutputStream outputStream) - метод кој ги печати сите пилоти сортирани според нивното најдобро време (најкраткото време од нивните 3 последни круга) во формат Driver_name best_lap со 10 места за името на возачот (порамнето од лево) и 10 места за времето на најдобриот круг порамнето од десно. Притоа времето е во истиот формат со времињата кои се читаат.
* */

public class F1Test {

    public static void main(String[] args) {
        F1Race f1Race = new F1Race();
        f1Race.readResults(System.in);
        f1Race.printSorted(System.out);
    }

}

class F1Race {
    // vashiot kod ovde

}

//Webber 2:32:103 2:49:182 2:18:132
//Vettel 2:55:023 3:14:987 2:56:134
//Massa 2:57:503 2:05:270 3:05:134
//Alonso 3:52:563 3:56:187 2:54:139
//Hamilton 1:56:074 2:04:371 3:06:009
//Raikonen 2:03:300 4:12:187 3:14:139


//1. Hamilton    1:56:074
//2. Raikonen    2:03:300
//3. Massa       2:05:270
//4. Webber      2:18:132
//5. Alonso      2:54:139
//6. Vettel      2:55:023